[
  {
    "path": "posts/2020-12-09-canberra-times-subscriber-articles/",
    "title": "Canberra Times Hidden Articles",
    "description": "Guide on how to retreive articles behind paywall.",
    "author": [
      {
        "name": "its-gazza",
        "url": {}
      }
    ],
    "date": "2020-12-09",
    "categories": [],
    "contents": "\nThe purpose of this post is to show how to read subscriber articles from the Canberra Times. Currently if you’re not a subscriber you’ll be given a paywall and will not be able to read the article. For example:\n\nHowever, if you look into the source code, the whole article is there! We will now show how to access the article body.\n\n\nlibrary(rvest)\nlibrary(stringr)\n\n\n\n\n\nurl <- 'https://www.canberratimes.com.au/story/7047552/tax-office-heads-taken-to-court-over-working-from-home-dispute/?cs=14263'\narticle <- read_html(url)\n\n# The article is always under: \n# <div itemprop=\"articleBody\", class=\"hidden\" aria-hidden=\"true\">\narticle_body <- article %>% \n  html_nodes(\".hidden\") %>% \n  .[2] %>%  # we're only interested in the second one itemprop=\"articleBody\"\n  html_text() %>% \n  print()\n\n\n[1] “Senior public servants at the Australian Taxation Office are being taken to court over allegations they breached the agency’s working from home policy, affecting almost 20,000 employees during its COVID-19 response. The Australian Services Union (ASU) announced on Wednesday morning it would launch federal court proceedings against the government, tax office commissioner Chris Jordan as well as four others in senior roles for alleged breaches of workplace laws. The proceedings against the office’s top officials will allege they did not give public servants adequate notice of changes to the working from home policy after some were required to return to the office for training during the height of the COVID-19 pandemic. The tax office’s more than 17,000 employees were directed to work from home in late March as the health crisis worsened but many were required to return to the office in April for training on the newly-launched government programs, including JobKeeper and Cashflow Boost. It’s alleged managers directed their staff to return to the office with inadequate notice, resulting in hardship for workers who had to organise arrangements for childcare at short notice. Jeff Lapidos, the union’s tax secretary, said taking the agency to court was the only way it could resolve the dispute after concerns it raised were brushed off. \"The ATO continued their brush-off. We were left with no choice,\" Mr Lapidos said. \"We believe the ATO is wrong to think it can pick and choose when our enterprise agreement applies. We are now asking the Federal Court to rule on this dispute.\" READ MORE: Mr Lapidos said at least 1000 employees were asked to return to the office with only three days’ notice during April - a direction, the union alleges, in breach of existing workplace agreements. The union said it first approached the ATO in April after public servants working in offices across the country raised concerns about the limited notice. Under the existing workplace agreement, a minimum of one week’s notice was required to temporarily suspend working from home arrangements and a full four weeks were needed for the permanent end to those arrangements. In May, nearly a month after ASU first approached the agency, the ATO responded its new COVID-19 working from home policy wasn’t covered by the enterprise agreement. It explained managers were told be as flexible as possible but that one week’s notice for return-to-office directions couldn’t be guaranteed. \"That’s not good enough from our point of view,\" Mr Lapidos said. \"We don’t think it’s optional for the office to decide whether they will comply with our enterprise agreement or not.\" A spokesperson for the tax office denied the union’s allegations it had brushed off complaints regarding its working from home changes. \"Contrary to claims of a brush-off, the ATO has remained committed to working with staff and staff representatives throughout the emergency situation, including multiple meetings with unions each week to ensure any staff concerns were identified and dealt with appropriately,\" an ATO spokesperson said. \"This approach has had great support and input from staff and representatives who, on the whole, remain appreciative of the efforts of the ATO and committed to supporting the community as best they can.\" The ATO said it thanked its public servants for their hard work and dedication during COVID-19 as roles quickly and temporarily changed in response to new measures.”\n\n\nAnd that’s it, you can now read the hidden article behind the paywall!\n\n\n\n",
    "preview": "posts/2020-12-09-canberra-times-subscriber-articles/paywall.JPG",
    "last_modified": "2020-12-09T20:04:22+11:00",
    "input_file": {}
  }
]
